{"config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0016behavioral_clonning.py\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "trainable": true, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "nb_col": 5, "nb_row": 5, "nb_filter": 24, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "nb_col": 5, "nb_row": 5, "nb_filter": 36, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "nb_col": 5, "nb_row": 5, "nb_filter": 48, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "border_mode": "same", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5", "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true, "trainable": true, "output_dim": 80, "init": "glorot_uniform", "input_dim": 64, "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true, "trainable": true, "output_dim": 40, "init": "glorot_uniform", "input_dim": 80, "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true, "trainable": true, "output_dim": 16, "init": "glorot_uniform", "input_dim": 40, "name": "dense_3", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true, "trainable": true, "output_dim": 10, "init": "glorot_uniform", "input_dim": 16, "name": "dense_4", "b_constraint": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "input_dim": 10, "name": "dense_5", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}